In [1]:
# Dependencies
import pandas as pd
import numpy as np

In [2]:
# Create DataFrames
industry_unemployment_2022_df = pd.read_excel('Resources/CPS2022_industry_unemployment.xlsx', skiprows = [0,1,2])
industry_unemployment_2021_df = pd.read_excel('Resources/CPS2021_industry_unemployment.xlsx', skiprows = [0,1,2])
industry_unemployment_2020_df = pd.read_excel('Resources/CPS2020_industry_unemployment.xlsx', skiprows = [0,1,2])
industry_unemployment_2019_df = pd.read_excel('Resources/CPS2019_industry_unemployment.xlsx', skiprows = [0,1,2])
industry_unemployment_2018_df = pd.read_excel('Resources/CPS2018_industry_unemployment.xlsx', skiprows = [0,1,2])
industry_unemployment_2022_df.head(10)

,Occupation and industry,2022,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,NaN,Unemployed,NaN,NaN,NaN,NaN,NaN,Weeks,NaN
1,NaN,Total,Less\nthan\n5 weeks,5 to 14\nweeks,15 weeks and over,NaN,NaN,Average\n(mean)\nduration,Median\nduration
2,NaN,NaN,NaN,NaN,Total,15 to 26\nweeks,27 weeks\nand over,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Total unemployed(1),5996,2216,1711,2070,756,1314,22.6,8.7
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,No previous work experience,482,183,148,150,53,98,22.6,8.3
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,OCCUPATION,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,"Management, professional, and related occupations",1355,473,402,481,170,310,24.2,9

In [3]:
industry_unemployment_2022_df.columns

Index(['Occupation and industry',                      2022,
                    'Unnamed: 2',              'Unnamed: 3',
                    'Unnamed: 4',              'Unnamed: 5',
                    'Unnamed: 6',              'Unnamed: 7',
                    'Unnamed: 8'],
      dtype='object')

In [4]:
industry_unemployment_2022_df.rename(columns = {'Occupation and industry': "occupation_industry",
                                                2022: "total_unemployed",
                                                'Unnamed: 2': "less_than_five_wks",
                                                "Unnamed: 3": "five_to_forteen_wks",
                                                "Unnamed: 4": "total_fifteen_wks_and_over",
                                                "Unnamed: 5": "fifteen_to_twenty_six_wks",
                                                "Unnamed: 6": "twenty_seven_wks_and_over",
                                                "Unnamed: 7": "avg_duration_wks",
                                                "Unnamed: 8": "median_duration_wks"}, inplace=True)
industry_unemployment_2021_df.rename(columns = {'Occupation and industry': "occupation_industry",
                                                2021: "total_unemployed",
                                                'Unnamed: 2': "less_than_five_wks",
                                                "Unnamed: 3": "five_to_forteen_wks",
                                                "Unnamed: 4": "total_fifteen_wks_and_over",
                                                "Unnamed: 5": "fifteen_to_twenty_six_wks",
                                                "Unnamed: 6": "twenty_seven_wks_and_over",
                                                "Unnamed: 7": "avg_duration_wks",
                                                "Unnamed: 8": "median_duration_wks"}, inplace=True)
industry_unemployment_2020_df.rename(columns = {'Occupation and industry': "occupation_industry",
                                                2020: "total_unemployed",
                                                'Unnamed: 2': "less_than_five_wks",
                                                "Unnamed: 3": "five_to_forteen_wks",
                                                "Unnamed: 4": "total_fifteen_wks_and_over",
                                                "Unnamed: 5": "fifteen_to_twenty_six_wks",
                                                "Unnamed: 6": "twenty_seven_wks_and_over",
                                                "Unnamed: 7": "avg_duration_wks",
                                                "Unnamed: 8": "median_duration_wks"}, inplace=True)
industry_unemployment_2019_df.rename(columns = {'Occupation and industry': "occupation_industry",
                                                2019: "total_unemployed",
                                                'Unnamed: 2': "less_than_five_wks",
                                                "Unnamed: 3": "five_to_forteen_wks",
                                                "Unnamed: 4": "total_fifteen_wks_and_over",
                                                "Unnamed: 5": "fifteen_to_twenty_six_wks",
                                                "Unnamed: 6": "twenty_seven_wks_and_over",
                                                "Unnamed: 7": "avg_duration_wks",
                                                "Unnamed: 8": "median_duration_wks"}, inplace=True)
industry_unemployment_2018_df.rename(columns = {'Occupation and industry': "occupation_industry",
                                                '2018': "total_unemployed",
                                                'Unnamed: 2': "less_than_five_wks",
                                                "Unnamed: 3": "five_to_forteen_wks",
                                                "Unnamed: 4": "total_fifteen_wks_and_over",
                                                "Unnamed: 5": "fifteen_to_twenty_six_wks",
                                                "Unnamed: 6": "twenty_seven_wks_and_over",
                                                "Unnamed: 7": "avg_duration_wks",
                                                "Unnamed: 8": "median_duration_wks"}, inplace=True)
industry_unemployment_2018_df.head()

,occupation_industry,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,NaN,Unemployed,NaN,NaN,NaN,NaN,NaN,Weeks,NaN
1,NaN,Total,Less\nthan\n5 weeks,5 to 14\nweeks,15 weeks and over,NaN,NaN,Average\n(mean)\nduration,Median\nduration
2,NaN,NaN,NaN,NaN,Total,15 to 26\nweeks,27 weeks\nand over,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Total unemployed(1),6314,2170,1876,2268,917,1350,22.7,9.3

In [5]:
industry_2022_df = industry_unemployment_2022_df.dropna()
industry_2021_df = industry_unemployment_2021_df.dropna()
industry_2020_df = industry_unemployment_2020_df.dropna()
industry_2019_df = industry_unemployment_2019_df.dropna()
industry_2018_df = industry_unemployment_2018_df.dropna()
industry_2020_df.head()

,occupation_industry,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
4,Total unemployed(1),12947,3708,4728,4511,2516,1995,16.5,9.7
6,No previous work experience,526,161,166,198,80,118,24.2,10.2
9,"Management, professional, and related occupations",3029,837,1098,1094,602,493,17.1,10
10,"Management, business, and financial operations...",1149,312,377,460,244,216,18.1,10.9
11,Professional and related occupations,1880,525,720,634,357,277,16.5,9.6

In [6]:
industry_2022 = industry_2022_df.reset_index(drop=True)
industry_2021 = industry_2021_df.reset_index(drop=True)
industry_2020 = industry_2020_df.reset_index(drop=True)
industry_2019 = industry_2019_df.reset_index(drop=True)
industry_2018 = industry_2018_df.reset_index(drop=True)
industry_2019

,occupation_industry,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,Total unemployed(1),6001,2086,1789,2126,860,1266,21.6,9.1
1,No previous work experience,591,196,182,214,81,132,24.8,9.4
2,"Management, professional, and related occupations",1310,436,388,487,181,306,22.6,9.5
3,"Management, business, and financial operations...",499,153,138,209,77,132,23,11.1
4,Professional and related occupations,811,283,250,278,104,174,22.4,8.8
5,Service occupations,1255,465,364,426,181,245,20,8.6
6,Sales and office occupations,1274,422,375,476,193,283,22.6,9.9
7,Sales and related occupations,614,210,176,228,84,144,22.3,9.6
8,Office and administrative support occupations,659,212,200,248,109,139,22.9,10.1
9,"Natural resources, construction, and maintenan...",703,266,216,221,100,121,17.8,8.2
10,"Farming, fishing, and forestry occupations",123,44,38,40,22,18,15,8.5
11,Construction and extraction occupations,452,183,139,131,59,72,16.3,7.5
12,"Installation, maintenance, and repair occupations",129,39,38,51,19,31,26.1,10.4
13,"Production, transportation, and material movin...",847,296,259,292,121,171,21.5,8.9
14,Production occupations,350,126,109,116,51,65,19.6,8.6
15,Transportation and material moving occupations,497,170,150,176,70,107,22.9,9.2
16,Agriculture and related industries,133,45,45,43,22,21,16.1,8.7
17,"Mining, quarrying, and oil and gas extraction",25,11,7,7,3,4,–,–
18,Construction,442,174,138,131,54,76,17.3,7.8
19,Manufacturing,476,158,147,171,73,99,20.9,9.6
20,Durable goods,280,93,88,99,38,60,21.3,9.5
21,Nondurable goods,197,65,59,73,34,38,20.3,9.8
22,Wholesale and retail trade,813,263,251,299,120,178,22.4,9.7
23,Transportation and utilities,271,95,69,108,39,69,26.2,9.6
24,Information,93,26,27,40,15,25,27.8,11.2
25,Financial activities,222,61,67,93,35,58,25.1,11.8
26,Professional and business services,671,215,195,260,107,153,21.2,10.1
27,Education and health services,850,311,279,259,107,152,19.2,8.1
28,Leisure and hospitality,773,303,223,248,111,137,18.7,8
29,Other services,218,78,54,86,33,53,24,9.7
30,Public administration,138,39,37,62,26,36,27.6,12.2

In [7]:
rm_subcategories = [3, 4, 7, 8, 10, 11, 12, 14, 15, 20, 21]
industry_2022.drop(industry_2022.index[rm_subcategories], inplace=True)
industry_2022_clean = industry_2022.reset_index(drop=True)
industry_2022_clean.head()

,occupation_industry,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,Total unemployed(1),5996,2216,1711,2070,756,1314,22.6,8.7
1,No previous work experience,482,183,148,150,53,98,22.6,8.3
2,"Management, professional, and related occupations",1355,473,402,481,170,310,24.2,9
3,Service occupations,1281,487,346,447,157,290,22.3,8.4
4,Sales and office occupations,1176,412,342,423,171,252,22.2,9.3

In [8]:
industry_2021.drop(industry_2021.index[rm_subcategories], inplace=True)
industry_2021_clean = industry_2021.reset_index(drop=True)
industry_2021_clean.head()

,occupation_industry,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,Total unemployed(1),8623,2140,1981,4501,1164,3337,28.7,16.5
1,No previous work experience,518,179,140,198,69,129,23.8,9.7
2,"Management, professional, and related occupations",1889,415,406,1068,244,823,31.8,20.9
3,Service occupations,2057,503,480,1074,262,812,28.1,16.6
4,Sales and office occupations,1685,406,385,893,232,661,29.2,17.2

In [9]:
industry_2020.drop(industry_2020.index[rm_subcategories], inplace=True)
industry_2020_clean = industry_2020.reset_index(drop=True)
industry_2020_clean.head()

,occupation_industry,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,Total unemployed(1),12947,3708,4728,4511,2516,1995,16.5,9.7
1,No previous work experience,526,161,166,198,80,118,24.2,10.2
2,"Management, professional, and related occupations",3029,837,1098,1094,602,493,17.1,10
3,Service occupations,3407,932,1292,1183,690,493,15.4,9.8
4,Sales and office occupations,2591,755,948,889,498,391,16.3,9.6

In [10]:
industry_2019.drop(industry_2019.index[rm_subcategories], inplace=True)
industry_2019_clean = industry_2019.reset_index(drop=True)
industry_2019_clean.head()

,occupation_industry,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,Total unemployed(1),6001,2086,1789,2126,860,1266,21.6,9.1
1,No previous work experience,591,196,182,214,81,132,24.8,9.4
2,"Management, professional, and related occupations",1310,436,388,487,181,306,22.6,9.5
3,Service occupations,1255,465,364,426,181,245,20,8.6
4,Sales and office occupations,1274,422,375,476,193,283,22.6,9.9

In [11]:
industry_2018.drop(industry_2018.index[rm_subcategories], inplace=True)
industry_2018_clean = industry_2018.reset_index(drop=True)
industry_2018_clean.head()

,occupation_industry,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,Total unemployed(1),6314,2170,1876,2268,917,1350,22.7,9.3
1,No previous work experience,602,203,188,211,85,126,23.4,9.2
2,"Management, professional, and related occupations",1346,443,393,509,197,312,24.5,9.8
3,Service occupations,1353,506,400,447,191,257,21.5,8.5
4,Sales and office occupations,1337,430,402,505,190,315,23.9,9.9

In [12]:
industry_2022_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   occupation_industry         20 non-null     object
 1   total_unemployed            20 non-null     object
 2   less_than_five_wks          20 non-null     object
 3   five_to_forteen_wks         20 non-null     object
 4   total_fifteen_wks_and_over  20 non-null     object
 5   fifteen_to_twenty_six_wks   20 non-null     object
 6   twenty_seven_wks_and_over   20 non-null     object
 7   avg_duration_wks            20 non-null     object
 8   median_duration_wks         20 non-null     object
dtypes: object(9)
memory usage: 1.5+ KB

In [13]:
industry_2022_clean[['total_unemployed','less_than_five_wks', 'five_to_forteen_wks', 'total_fifteen_wks_and_over', 'fifteen_to_twenty_six_wks', 
                     'twenty_seven_wks_and_over']] = industry_2022_clean[['total_unemployed','less_than_five_wks', 'five_to_forteen_wks', 
                                                                               'total_fifteen_wks_and_over','fifteen_to_twenty_six_wks', 
                                                                               'twenty_seven_wks_and_over']].astype(str).astype(int)
industry_2022_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   occupation_industry         20 non-null     object
 1   total_unemployed            20 non-null     int32
 2   less_than_five_wks          20 non-null     int32
 3   five_to_forteen_wks         20 non-null     int32
 4   total_fifteen_wks_and_over  20 non-null     int32
 5   fifteen_to_twenty_six_wks   20 non-null     int32
 6   twenty_seven_wks_and_over   20 non-null     int32
 7   avg_duration_wks            20 non-null     object
 8   median_duration_wks         20 non-null     object
dtypes: int32(6), object(3)
memory usage: 1.1+ KB

In [14]:
industry_2021_clean[['total_unemployed','less_than_five_wks', 'five_to_forteen_wks', 'total_fifteen_wks_and_over', 'fifteen_to_twenty_six_wks', 
                     'twenty_seven_wks_and_over']] = industry_2021_clean[['total_unemployed','less_than_five_wks', 'five_to_forteen_wks', 
                                                                          'total_fifteen_wks_and_over','fifteen_to_twenty_six_wks', 
                                                                          'twenty_seven_wks_and_over']].astype(str).astype(int)
industry_2021_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   occupation_industry         20 non-null     object
 1   total_unemployed            20 non-null     int32
 2   less_than_five_wks          20 non-null     int32
 3   five_to_forteen_wks         20 non-null     int32
 4   total_fifteen_wks_and_over  20 non-null     int32
 5   fifteen_to_twenty_six_wks   20 non-null     int32
 6   twenty_seven_wks_and_over   20 non-null     int32
 7   avg_duration_wks            20 non-null     object
 8   median_duration_wks         20 non-null     object
dtypes: int32(6), object(3)
memory usage: 1.1+ KB

In [15]:
industry_2020_clean[['total_unemployed','less_than_five_wks', 'five_to_forteen_wks', 'total_fifteen_wks_and_over', 'fifteen_to_twenty_six_wks', 
                     'twenty_seven_wks_and_over']] = industry_2020_clean[['total_unemployed','less_than_five_wks', 'five_to_forteen_wks', 
                                                                          'total_fifteen_wks_and_over','fifteen_to_twenty_six_wks', 
                                                                          'twenty_seven_wks_and_over']].astype(str).astype(int)
industry_2020_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   occupation_industry         20 non-null     object
 1   total_unemployed            20 non-null     int32
 2   less_than_five_wks          20 non-null     int32
 3   five_to_forteen_wks         20 non-null     int32
 4   total_fifteen_wks_and_over  20 non-null     int32
 5   fifteen_to_twenty_six_wks   20 non-null     int32
 6   twenty_seven_wks_and_over   20 non-null     int32
 7   avg_duration_wks            20 non-null     object
 8   median_duration_wks         20 non-null     object
dtypes: int32(6), object(3)
memory usage: 1.1+ KB

In [16]:
industry_2019_clean[['total_unemployed','less_than_five_wks', 'five_to_forteen_wks', 'total_fifteen_wks_and_over', 'fifteen_to_twenty_six_wks', 
                     'twenty_seven_wks_and_over']] = industry_2019_clean[['total_unemployed','less_than_five_wks', 'five_to_forteen_wks', 
                                                                          'total_fifteen_wks_and_over','fifteen_to_twenty_six_wks', 
                                                                          'twenty_seven_wks_and_over']].astype(str).astype(int)
industry_2019_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   occupation_industry         20 non-null     object
 1   total_unemployed            20 non-null     int32
 2   less_than_five_wks          20 non-null     int32
 3   five_to_forteen_wks         20 non-null     int32
 4   total_fifteen_wks_and_over  20 non-null     int32
 5   fifteen_to_twenty_six_wks   20 non-null     int32
 6   twenty_seven_wks_and_over   20 non-null     int32
 7   avg_duration_wks            20 non-null     object
 8   median_duration_wks         20 non-null     object
dtypes: int32(6), object(3)
memory usage: 1.1+ KB

In [17]:
industry_2018_clean[['total_unemployed','less_than_five_wks', 'five_to_forteen_wks', 'total_fifteen_wks_and_over', 'fifteen_to_twenty_six_wks', 
                     'twenty_seven_wks_and_over']] = industry_2018_clean[['total_unemployed','less_than_five_wks', 'five_to_forteen_wks', 
                                                                          'total_fifteen_wks_and_over','fifteen_to_twenty_six_wks', 
                                                                          'twenty_seven_wks_and_over']].astype(str).astype(int)
industry_2018_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   occupation_industry         20 non-null     object
 1   total_unemployed            20 non-null     int32
 2   less_than_five_wks          20 non-null     int32
 3   five_to_forteen_wks         20 non-null     int32
 4   total_fifteen_wks_and_over  20 non-null     int32
 5   fifteen_to_twenty_six_wks   20 non-null     int32
 6   twenty_seven_wks_and_over   20 non-null     int32
 7   avg_duration_wks            20 non-null     object
 8   median_duration_wks         20 non-null     object
dtypes: int32(6), object(3)
memory usage: 1.1+ KB

In [18]:
occupations_industries = industry_2022_clean['occupation_industry'].unique()
print(occupations_industries)

['Total unemployed(1)' 'No previous work experience'
 'Management, professional, and related occupations' 'Service occupations'
 'Sales and office occupations'
 'Natural resources, construction, and maintenance occupations'
 'Production, transportation, and material moving occupations'
 'Agriculture and related industries'
 'Mining, quarrying, and oil and gas extraction' 'Construction'
 'Manufacturing' 'Wholesale and retail trade'
 'Transportation and utilities' 'Information' 'Financial activities'
 'Professional and business services' 'Education and health services'
 'Leisure and hospitality' 'Other services' 'Public administration']

In [19]:
print(len(occupations_industries))

20

In [20]:
occupation_ids = np.arange(1, 21)
print(occupation_ids)

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]

In [21]:
occ_ids = ["occ_" + str(occ_id) for occ_id in occupation_ids]
print(occ_ids)

['occ_1', 'occ_2', 'occ_3', 'occ_4', 'occ_5', 'occ_6', 'occ_7', 'occ_8', 'occ_9', 'occ_10', 'occ_11', 'occ_12', 'occ_13', 'occ_14', 'occ_15', 'occ_16', 'occ_17', 'occ_18', 'occ_19', 'occ_20']

In [22]:
occupation_df = pd.DataFrame({
    "occupation_id": occ_ids,
    "occupation_industry": occupations_industries
})
occupation_df

   occupation_id                                occupation_industry
0          occ_1                                Total unemployed(1)
1          occ_2                        No previous work experience
2          occ_3  Management, professional, and related occupations
3          occ_4                                Service occupations
4          occ_5                       Sales and office occupations
5          occ_6  Natural resources, construction, and maintenan...
6          occ_7  Production, transportation, and material movin...
7          occ_8                 Agriculture and related industries
8          occ_9      Mining, quarrying, and oil and gas extraction
9         occ_10                                       Construction
10        occ_11                                      Manufacturing
11        occ_12                         Wholesale and retail trade
12        occ_13                       Transportation and utilities
13        occ_14                                        Information
14        occ_15                               Financial activities
15        occ_16                 Professional and business services
16        occ_17                      Education and health services
17        occ_18                            Leisure and hospitality
18        occ_19                                     Other services
19        occ_20                              Public administration

In [24]:
occupation_df.to_csv("Resources/SQL_Tables/occupations_industries.csv", index=False)

In [25]:
merged_2022_df = industry_2022_clean.merge(occupation_df, on= 'occupation_industry', how= 'left')
merged_2022_df.head()

,occupation_industry,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks,occupation_id
0,Total unemployed(1),5996,2216,1711,2070,756,1314,22.6,8.7,occ_1
1,No previous work experience,482,183,148,150,53,98,22.6,8.3,occ_2
2,"Management, professional, and related occupations",1355,473,402,481,170,310,24.2,9,occ_3
3,Service occupations,1281,487,346,447,157,290,22.3,8.4,occ_4
4,Sales and office occupations,1176,412,342,423,171,252,22.2,9.3,occ_5

In [26]:
cleaned_2022_df = merged_2022_df.drop(['occupation_industry'], axis=1)
cleaned_2022_df.head()

,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks,occupation_id
0,5996,2216,1711,2070,756,1314,22.6,8.7,occ_1
1,482,183,148,150,53,98,22.6,8.3,occ_2
2,1355,473,402,481,170,310,24.2,9,occ_3
3,1281,487,346,447,157,290,22.3,8.4,occ_4
4,1176,412,342,423,171,252,22.2,9.3,occ_5

In [27]:
cols = cleaned_2022_df.columns.tolist()
cols

['total_unemployed',
 'less_than_five_wks',
 'five_to_forteen_wks',
 'total_fifteen_wks_and_over',
 'fifteen_to_twenty_six_wks',
 'twenty_seven_wks_and_over',
 'avg_duration_wks',
 'median_duration_wks',
 'occupation_id']

In [28]:
cols = cols[-1:] + cols[:-1]
cols

['occupation_id',
 'total_unemployed',
 'less_than_five_wks',
 'five_to_forteen_wks',
 'total_fifteen_wks_and_over',
 'fifteen_to_twenty_six_wks',
 'twenty_seven_wks_and_over',
 'avg_duration_wks',
 'median_duration_wks']

In [29]:
cleaned_2022_df = cleaned_2022_df[cols]
cleaned_2022_df.head()

,occupation_id,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,occ_1,5996,2216,1711,2070,756,1314,22.6,8.7
1,occ_2,482,183,148,150,53,98,22.6,8.3
2,occ_3,1355,473,402,481,170,310,24.2,9
3,occ_4,1281,487,346,447,157,290,22.3,8.4
4,occ_5,1176,412,342,423,171,252,22.2,9.3

In [30]:
merged_2021_df = industry_2021_clean.merge(occupation_df, on= 'occupation_industry', how= 'left')
merged_2020_df = industry_2020_clean.merge(occupation_df, on= 'occupation_industry', how= 'left')
merged_2019_df = industry_2019_clean.merge(occupation_df, on= 'occupation_industry', how= 'left')
merged_2018_df = industry_2018_clean.merge(occupation_df, on= 'occupation_industry', how= 'left')
merged_2021_df.head()

,occupation_industry,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks,occupation_id
0,Total unemployed(1),8623,2140,1981,4501,1164,3337,28.7,16.5,occ_1
1,No previous work experience,518,179,140,198,69,129,23.8,9.7,occ_2
2,"Management, professional, and related occupations",1889,415,406,1068,244,823,31.8,20.9,occ_3
3,Service occupations,2057,503,480,1074,262,812,28.1,16.6,occ_4
4,Sales and office occupations,1685,406,385,893,232,661,29.2,17.2,occ_5

In [31]:
cleaned_2021_df = merged_2021_df.drop(['occupation_industry'], axis=1)
cleaned_2020_df = merged_2020_df.drop(['occupation_industry'], axis=1)
cleaned_2019_df = merged_2019_df.drop(['occupation_industry'], axis=1)
cleaned_2018_df = merged_2018_df.drop(['occupation_industry'], axis=1)
cleaned_2021_df.head()

,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks,occupation_id
0,8623,2140,1981,4501,1164,3337,28.7,16.5,occ_1
1,518,179,140,198,69,129,23.8,9.7,occ_2
2,1889,415,406,1068,244,823,31.8,20.9,occ_3
3,2057,503,480,1074,262,812,28.1,16.6,occ_4
4,1685,406,385,893,232,661,29.2,17.2,occ_5

In [32]:
cleaned_2021_df = cleaned_2021_df[cols]
cleaned_2020_df = cleaned_2020_df[cols]
cleaned_2019_df = cleaned_2019_df[cols]
cleaned_2018_df = cleaned_2018_df[cols]
cleaned_2021_df.head()

,occupation_id,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,occ_1,8623,2140,1981,4501,1164,3337,28.7,16.5
1,occ_2,518,179,140,198,69,129,23.8,9.7
2,occ_3,1889,415,406,1068,244,823,31.8,20.9
3,occ_4,2057,503,480,1074,262,812,28.1,16.6
4,occ_5,1685,406,385,893,232,661,29.2,17.2

In [33]:
cleaned_2022_df.insert(0, 'year', '2022')
cleaned_2022_df.head()

,year,occupation_id,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,2022,occ_1,5996,2216,1711,2070,756,1314,22.6,8.7
1,2022,occ_2,482,183,148,150,53,98,22.6,8.3
2,2022,occ_3,1355,473,402,481,170,310,24.2,9
3,2022,occ_4,1281,487,346,447,157,290,22.3,8.4
4,2022,occ_5,1176,412,342,423,171,252,22.2,9.3

In [34]:
cleaned_2021_df.insert(0, 'year', '2021')
cleaned_2020_df.insert(0, 'year', '2020')
cleaned_2019_df.insert(0, 'year', '2019')
cleaned_2018_df.insert(0, 'year', '2018')
cleaned_2018_df.head()

,year,occupation_id,total_unemployed,less_than_five_wks,five_to_forteen_wks,total_fifteen_wks_and_over,fifteen_to_twenty_six_wks,twenty_seven_wks_and_over,avg_duration_wks,median_duration_wks
0,2018,occ_1,6314,2170,1876,2268,917,1350,22.7,9.3
1,2018,occ_2,602,203,188,211,85,126,23.4,9.2
2,2018,occ_3,1346,443,393,509,197,312,24.5,9.8
3,2018,occ_4,1353,506,400,447,191,257,21.5,8.5
4,2018,occ_5,1337,430,402,505,190,315,23.9,9.9

In [35]:
cleaned_2022_df.to_csv("Resources/SQL_Tables/cleaned_2022_unemployment_industries.csv", index=False)
cleaned_2021_df.to_csv("Resources/SQL_Tables/cleaned_2021_unemployment_industries.csv", index=False)
cleaned_2020_df.to_csv("Resources/SQL_Tables/cleaned_2020_unemployment_industries.csv", index=False)
cleaned_2019_df.to_csv("Resources/SQL_Tables/cleaned_2019_unemployment_industries.csv", index=False)
cleaned_2018_df.to_csv("Resources/SQL_Tables/cleaned_2018_unemployment_industries.csv", index=False)